def display_message():
    message = """
    ========================================
         Добро пожаловать в ButterEyes!
    ========================================
    
    Купите полную версию ButterEyes, чтобы получить
    больше функционала и исходный код!
    
    Что вы получите:
    - Исходный код программы
    - Полную техническую поддержку от создателя
    
    Свяжитесь для покупки:
    Телеграмм: @nokkat5
    
    ========================================
    """
    print(message)
    input()

if __name__ == "__main__":
    display_message()
