def display_message():
    message = """
    ========================================
         Добро пожаловать в ButterEyes!
    ========================================
    
    Купите полную версию ButterEyes, чтобы получить
    доступ к данным после запуска программы на
    другом ПК!
    
    Что вы получите:
    - Исходный код программы
    - Полную техническую поддержку от создателя
    
    Свяжитесь со мной для покупки:
    Телеграмм: @Sergey_Complete
    
    ========================================
    Нажмите Enter, чтобы закрыть программу.
    """
    print(message)
    input()  # Ждём, пока пользователь нажмёт Enter

if __name__ == "__main__":
    display_message()
